import { Metadata } from 'next';
 import ViralVideoCoursePage from'./ViralVideoCoursePage';

export const metadata: Metadata = {
  title: 'Секрети Вірусних Відео - Від 0 до 100,000 за 90 днів',
  description: 'Стати відомим лише за 3 місяці без витрат на рекламу! Дізнайтеся ключ до створення вірусного контенту та перетворите свої ідеї на мільйонні перегляди. Курс українською мовою.',
  keywords: 'вірусні відео, створення контенту, відеомаркетинг, соціальні мережі, монетизація відео, український курс, контент креатор, вірусний контент',
  
  openGraph: {
    title: 'Секрети Вірусних Відео - Від 0 до 100,000 за 90 днів',
    description: 'Стати відомим лише за 3 місяці без витрат на рекламу! Дізнайтеся ключ до створення вірусного контенту та перетворите свої ідеї на мільйонні перегляди.',
  }
}

export default function Page() {
  return <ViralVideoCoursePage />
}
